In [1]:
#
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from numpy import nan as NA
import sys

In [2]:
#
import matplotlib.pylab as plt
from numpy.random import randn
%matplotlib inline

# Chapter 9: Data Aggregation and Group Operations

Run next cell to create a data frame 'df'

In [3]:
#
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),
                'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.181435  0.533855    a  one
1  1.528150  0.515060    a  two
2  0.918173 -0.261262    b  one
3 -1.423554  1.208514    b  two
4  0.931415 -0.206884    a  one

Group df.data1 by key1, and compute the mean value of each group

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    1.213667
b   -0.252690
Name: data1, dtype: float64

Group data1 by key1 and key2, then compute the mean value of each group. Return the result as means

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.056425
      two     1.528150
b     one     0.918173
      two    -1.423554
Name: data1, dtype: float64

Run next cell to create 'states' and 'years'

In [6]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years  = np.array([2005, 2005, 2006, 2005, 2006])

Group data1 by two arrays: ['Ohio', 'California', 'California', 'Ohio', 'Ohio'] and [2005, 2005, 2006, 2005, 2006]. And calculate the mean value of each group.

In [7]:
df['data1'].groupby([states, years]).mean()

California  2005    1.528150
            2006    0.918173
Ohio        2005   -0.121060
            2006    0.931415
Name: data1, dtype: float64

Group df by 'key1', and calculate the group mean

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     1.213667  0.280677
b    -0.252690  0.473626

Iteratively print the name and group content from df.groupby('key1')

In [9]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.181435  0.533855    a  one
1  1.528150  0.515060    a  two
4  0.931415 -0.206884    a  one
b
      data1     data2 key1 key2
2  0.918173 -0.261262    b  one
3 -1.423554  1.208514    b  two

Iteratively print the name and group content of df.group(['key1', 'key2'])

In [10]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0  1.181435  0.533855    a  one
4  0.931415 -0.206884    a  one
a two
     data1    data2 key1 key2
1  1.52815  0.51506    a  two
b one
      data1     data2 key1 key2
2  0.918173 -0.261262    b  one
b two
      data1     data2 key1 key2
3 -1.423554  1.208514    b  two

Convert the output of last qeustion to a dict in the format of ('a', 'one'): sub-dataframe

In [11]:
pieces = dict(list(df.groupby(['key1', 'key2'])))
pieces

{('a', 'one'):       data1     data2 key1 key2
 0  1.181435  0.533855    a  one
 4  0.931415 -0.206884    a  one, ('a', 'two'):      data1    data2 key1 key2
 1  1.52815  0.51506    a  two, ('b', 'one'):       data1     data2 key1 key2
 2  0.918173 -0.261262    b  one, ('b', 'two'):       data1     data2 key1 key2
 3 -1.423554  1.208514    b  two}

Run the next cell to create a dataframe people

In [12]:
#
people = DataFrame(np.random.randn(5, 5), 
                  columns=['a', 'b', 'c', 'd', 'e'],
                  index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.loc[2:3, ['b', 'c']] = np.nan
people

               a         b         c         d         e
Joe    -0.527744  0.233652  1.312348  0.451974 -0.662662
Steve   0.452172  0.965440  0.209115  0.578234 -0.912096
Wes     0.387360       NaN       NaN  1.414190 -0.530548
Jim    -1.509061  0.847416 -0.369344  0.089360  0.139458
Travis -0.832780 -1.775893 -0.321917 -0.583336  1.322889

Run next cell to create a dict 'mapping'

In [13]:
#
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

Now group people by a dictionary "mapping" in axis 1. Then calculate the sum in each group

In [14]:
by_column = people.groupby(mapping, axis=1)

In [15]:
by_column.sum()

            blue       red
Joe     1.764322 -0.956754
Steve   0.787349  0.505516
Wes     1.414190 -0.143188
Jim    -0.279984 -0.522188
Travis -0.905254 -1.285784

Use one-line code to group people by name length. Then print out the result

In [16]:
result = people.groupby(lambda x: len(x))
for (key, content) in result:
    print(key)
    print(content)
    print('==========================')

3
            a         b         c         d         e
Joe -0.527744  0.233652  1.312348  0.451974 -0.662662
Wes  0.387360       NaN       NaN  1.414190 -0.530548
Jim -1.509061  0.847416 -0.369344  0.089360  0.139458
==========================
5
              a        b         c         d         e
Steve  0.452172  0.96544  0.209115  0.578234 -0.912096
==========================
6
              a         b         c         d         e
Travis -0.83278 -1.775893 -0.321917 -0.583336  1.322889
==========================

Run next cell to create a list of 'key_list'

In [17]:
#
key_list = ['one', 'one', 'one', 'two', 'two']

Now group people by both the function above and a key_list. Then print out the result

In [18]:
result = people.groupby([lambda x: len(x), key_list])
for key, content in result:
    print(key)
    print(content)
    print("===================")

(3, 'one')
            a         b         c         d         e
Joe -0.527744  0.233652  1.312348  0.451974 -0.662662
Wes  0.387360       NaN       NaN  1.414190 -0.530548
===================
(3, 'two')
            a         b         c        d         e
Jim -1.509061  0.847416 -0.369344  0.08936  0.139458
===================
(5, 'one')
              a        b         c         d         e
Steve  0.452172  0.96544  0.209115  0.578234 -0.912096
===================
(6, 'two')
              a         b         c         d         e
Travis -0.83278 -1.775893 -0.321917 -0.583336  1.322889
===================

Run next cell to create a multi-level dataframe hier_df

In [19]:
#
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                   names = ['cty', 'tenor'])
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.631207  0.785048 -0.018862  2.540780  1.489073
1      0.950582 -0.555157 -0.571123 -0.870506 -1.249987
2     -1.859984  0.522900  0.127511  0.047631  0.802309
3      0.269139 -0.718764 -0.147272 -0.458647  0.685211

Now group hier_df by the level of cty and print it out

In [20]:
result = hier_df.groupby(level='cty', axis=1)

In [21]:
for (key, content) in result:
    print(key)
    print(content)
    print("=========================")

JP
cty          JP
tenor         1         3
0      2.540780  1.489073
1     -0.870506 -1.249987
2      0.047631  0.802309
3     -0.458647  0.685211
=========================
US
cty          US
tenor         1         3         5
0     -0.631207  0.785048 -0.018862
1      0.950582 -0.555157 -0.571123
2     -1.859984  0.522900  0.127511
3      0.269139 -0.718764 -0.147272
=========================

Group df by key1, then compute the quantile of data1 at 0.9 for each group

In [22]:
grouped = df.groupby('key1')

In [23]:
grouped['data1'].quantile(0.9)

key1
a    1.458807
b    0.684001
Name: data1, dtype: float64

Define your own aggregation function to compute max-min for each group

In [24]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [25]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.596735  0.740739
b     2.341727  1.469776

Create a dataframe "tips" from examples/tips.csv

In [26]:
tips = pd.read_csv('examples/tips.csv')
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

Add a new column 'tip_pct', i.e., tip divided by total bill

In [27]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

Group tips by 'smoker' and return the result as 'grouped'

In [28]:
grouped = tips.groupby(['smoker'])

Define grouped_pct as the column of 'tip_pct' of grouped

In [29]:
grouped_pct = grouped['tip_pct']

Return a dataframe showing the mean, std, and max-min of grouped_pct for each group

In [30]:
grouped_pct.agg([np.mean, np.std, peak_to_peak])

            mean       std  peak_to_peak
smoker
No      0.159328  0.039910      0.235193
Yes     0.163196  0.085119      0.674707

Repeat last question, but rename mean as 'foo', 'std' as 'bar', and max-min as 'range'

In [31]:
grouped_pct.agg([('foo', np.mean), ('bar', np.std), ('range', peak_to_peak)])

             foo       bar     range
smoker
No      0.159328  0.039910  0.235193
Yes     0.163196  0.085119  0.674707

For each group in 'grouped', compute max of 'tip', and sum of 'size

In [32]:
grouped.agg({'tip': np.max, 'size': 'sum'})

         tip  size
smoker
No       9.0   403
Yes     10.0   224

For each group in 'grouped', compute min, max, mean, std of 'tip_pct', and compute sum of 'size'

In [33]:
grouped.agg({'tip_pct': [np.min, np.max, np.mean, np.std], \
             'size': np.sum})

         tip_pct                               size
            amin      amax      mean       std  sum
smoker
No      0.056797  0.291990  0.159328  0.039910  403
Yes     0.035638  0.710345  0.163196  0.085119  224

Group tips by 'smokder' and return an 'unindexed' form, then compute the mean value of each group

In [34]:
tips.groupby('smoker', as_index=False).mean()

  smoker  total_bill       tip      size   tip_pct
0     No   19.188278  2.991854  2.668874  0.159328
1    Yes   20.756344  3.008710  2.408602  0.163196

Run next cell to create a list of key

In [35]:
#
key = ['one', 'two', 'one', 'two', 'one']

For the dataframe 'people', replace all its element by the group mean. The group mean is from people.groupby(key).mean()

In [36]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.324388 -0.771120  0.495215  0.427609  0.043226
Steve  -0.528445  0.906428 -0.080115  0.333797 -0.386319
Wes    -0.324388 -0.771120  0.495215  0.427609  0.043226
Jim    -0.528445  0.906428 -0.080115  0.333797 -0.386319
Travis -0.324388 -0.771120  0.495215  0.427609  0.043226

Subtract the group mean from each elemnt of people. Return the result as demeaned

In [37]:
def demean(arr):
    return arr - arr.mean()

In [38]:
demeaned = people.groupby(key).transform(demean)

In [39]:
demeaned

               a         b         c         d         e
Joe    -0.203356  1.004772  0.817133  0.024365 -0.705889
Steve   0.980617  0.059012  0.289229  0.244437 -0.525777
Wes     0.711748       NaN       NaN  0.986581 -0.573774
Jim    -0.980617 -0.059012 -0.289229 -0.244437  0.525777
Travis -0.508392 -1.004772 -0.817133 -1.010946  1.279662

Group tips by 'smoker', and return the top five values sorted by tip_pct for each group and each column. First you need to define a top function.

In [40]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(column, ascending=False).iloc[:n]

In [41]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

Now use the same top function to return the top 1 value sorted by 'total_bill'.

In [42]:
tips.groupby('smoker').apply(top, n=1, column='total_bill')

            total_bill   tip smoker  day    time  size   tip_pct
smoker
No     212       48.33   9.0     No  Sat  Dinner     4  0.186220
Yes    170       50.81  10.0    Yes  Sat  Dinner     3  0.196812

Run next cell to create a dataframe "frame"

In [43]:
frame = DataFrame({'data1': np.random.randn(1000), 
                  'data2': np.random.randn(1000)})
frame.head()

      data1     data2
0  0.748815 -1.692683
1 -0.776386 -2.033369
2 -1.312471  0.424101
3 -1.158065  0.114311
4  1.473075 -1.536679

Group frame.data2 by 4 bins of frame.data1 of equal width

In [44]:
factor = pd.cut(frame.data1, 4)

In [45]:
grouped = frame.data2.groupby(factor)

Calculate the count, max, mean, min of each group

In [46]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [47]:
grouped.apply(get_stats)

data1
(-2.889, -1.292]  count     96.000000
                  max        2.489646
                  mean      -0.170291
                  min       -3.013088
(-1.292, 0.299]   count    548.000000
                  max        2.835716
                  mean       0.081484
                  min       -4.038936
(0.299, 1.89]     count    326.000000
                  max        2.403027
                  mean      -0.105351
                  min       -3.352657
(1.89, 3.482]     count     30.000000
                  max        1.539639
                  mean       0.178234
                  min       -1.214820
Name: data2, dtype: float64

Run the next to create a Series of 'data'

In [48]:
#
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
data = Series(np.random.randn(8), index=states)
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.955818
New York     -0.045617
Vermont            NaN
Florida       0.544313
Oregon        1.927100
Nevada             NaN
California    0.396807
Idaho              NaN
dtype: float64

We define the first 4 states as "East" group and the other 4 states as "West" group. Now fill in the missing value in data by the mean value of each group.

In [49]:
group_key = ['East']*4 + ['West']*4

In [50]:
fill_mean = lambda g: g.fillna(g.mean())

In [51]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.955818
New York     -0.045617
Vermont       0.484838
Florida       0.544313
Oregon        1.927100
Nevada        1.161954
California    0.396807
Idaho         1.161954
dtype: float64

Similar to previous question, but fill in the missing value in 'East' group as 0.5, and 'West' group as -1.

In [52]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])

In [53]:
data.groupby(group_key).apply(fill_func)

Ohio          0.955818
New York     -0.045617
Vermont       0.500000
Florida       0.544313
Oregon        1.927100
Nevada       -1.000000
California    0.396807
Idaho        -1.000000
dtype: float64

Run the next cell to create a dataframe "deck"

In [54]:
#
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10]*3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'Q', 'K']

cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = Series(card_val, index=cards)
deck.head(14)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
QH     10
KH     10
AS      1
dtype: int64

Randomly draw 5 cards from the deck

In [55]:
def draw(deck, n=5):
    # return deck.take(np.random.permutation(len(deck))[:n])
    return deck[np.random.permutation(len(deck))[:n]]

In [56]:
draw(deck)

QS    10
4S     4
2D     2
3S     3
3D     3
dtype: int64

Now randomly select two cards from each suit

In [57]:
get_suit = lambda card: card[-1]

In [58]:
deck.groupby(get_suit).apply(draw, n=2)

C  9C     9
   KC    10
D  8D     8
   KD    10
H  6H     6
   8H     8
S  5S     5
   4S     4
dtype: int64

Run next cell to create a dataframe 'df'

In [59]:
#
df = DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                'data': np.random.randn(8),
                'weights': np.random.rand(8)})
df

  category      data   weights
0        a  0.259090  0.549038
1        a  1.486596  0.819717
2        a -1.365114  0.201069
3        a  0.573095  0.847920
4        b  0.408498  0.444190
5        b -1.242302  0.747651
6        b  0.050032  0.387761
7        b  0.023706  0.335433

Group df by category, and compute the weighted average of data in each group.

In [60]:
grouped = df.groupby('category')

In [61]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [62]:
grouped.apply(get_wavg)

category
a    0.650314
b   -0.375975
dtype: float64

Create a dataframe close_px from stock_px.csv

In [63]:
close_px = pd.read_csv('examples/stock_px.csv', parse_dates=True, index_col=0)
close_px.head()

              AA  AAPL    GE    IBM   JNJ  MSFT   PEP     SPX   XOM
1990-02-01  4.98  7.86  2.87  16.79  4.27  0.51  6.04  328.79  6.12
1990-02-02  5.04  8.00  2.87  16.89  4.37  0.51  6.09  330.92  6.24
1990-02-05  5.07  8.18  2.87  17.32  4.34  0.51  6.05  331.85  6.25
1990-02-06  5.01  8.12  2.88  17.56  4.32  0.51  6.15  329.66  6.23
1990-02-07  5.04  7.77  2.91  17.93  4.38  0.51  6.17  333.75  6.33

Create a dataframe rets as the daily percentage change of each column. Drop NaN values.

In [64]:
rets = close_px.pct_change().dropna()

Calculate the correlation of daily pencentage change for each stock with SPX. Show the result of each year.

In [65]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [66]:
by_year = rets.groupby(lambda x: x.year)

In [67]:
by_year.apply(spx_corr)

,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
1990,0.595024,0.545067,0.752187,0.738361,0.801145,0.586691,0.783168,1.0,0.517586
1991,0.453574,0.365315,0.759607,0.557046,0.646401,0.524225,0.641775,1.0,0.569335
1992,0.398180,0.498732,0.632685,0.262232,0.515740,0.492345,0.473871,1.0,0.318408
1993,0.259069,0.238578,0.447257,0.211269,0.451503,0.425377,0.385089,1.0,0.318952
1994,0.428549,0.268420,0.572996,0.385162,0.372962,0.436585,0.450516,1.0,0.395078
1995,0.291532,0.161829,0.519126,0.416390,0.315733,0.453660,0.413144,1.0,0.368752
1996,0.292344,0.191482,0.750724,0.388497,0.569232,0.564015,0.421477,1.0,0.538736
1997,0.564427,0.211435,0.827512,0.646823,0.703538,0.606171,0.509344,1.0,0.695653
1998,0.533802,0.379883,0.815243,0.623982,0.591988,0.698773,0.494213,1.0,0.369264
1999,0.099033,0.425584,0.710928,0.486167,0.517061,0.631315,0.336593,1.0,0.315383
2000,0.265359,0.440161,0.610362,0.445114,0.189765,0.538005,0.077525,1.0,0.084163
2001,0.624069,0.577152,0.794632,0.696038,0.111493,0.696447,0.133975,1.0,0.336869
2002,0.747905,0.580306,0.822336,0.716833,0.585058,0.784607,0.487370,1.0,0.760069
2003,0.690466,0.545582,0.777643,0.741775,0.562399,0.750534,0.541487,1.0,0.662775
2004,0.591485,0.374283,0.728626,0.601740,0.354690,0.588531,0.466854,1.0,0.557742
2005,0.564267,0.467540,0.675637,0.516846,0.444728,0.562374,0.489559,1.0,0.631010
2006,0.487638,0.428267,0.612388,0.598636,0.394026,0.406126,0.335054,1.0,0.518514
2007,0.642427,0.508118,0.796945,0.603906,0.568423,0.658770,0.651911,1.0,0.786264
2008,0.781057,0.681434,0.777337,0.833074,0.801005,0.804626,0.709264,1.0,0.828303
2009,0.735642,0.707103,0.713086,0.684513,0.603146,0.654902,0.541474,1.0,0.797921
2010,0.745700,0.710105,0.822285,0.783638,0.689896,0.730118,0.626655,1.0,0.839057
2011,0.882045,0.691931,0.864595,0.802730,0.752379,0.800996,0.592029,1.0,0.859975

Calculate the correlation between the daily percentage change of AAPL and MSFT. Show the result in each year.

In [68]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

1990    0.408271
1991    0.266807
1992    0.450592
1993    0.236917
1994    0.361638
1995    0.258642
1996    0.147539
1997    0.196144
1998    0.364106
1999    0.329484
2000    0.275298
2001    0.563156
2002    0.571095
2003    0.486262
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64